#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
aws_vpc.this: Refreshing state... [id=vpc-0a34cc7aa9ab4a18f]
data.aws_ami.ubuntu: Reading...
aws_route_table.private: Refreshing state... [id=rtb-054c9885c3f9192c4]
aws_subnet.this["pvt_b"]: Refreshing state... [id=subnet-0469e452ea59238e0]
aws_internet_gateway.this: Refreshing state... [id=igw-0f807cdfe5f7c6352]
aws_subnet.this["pub_b"]: Refreshing state... [id=subnet-014b64dbe1018cde5]
aws_subnet.this["pub_a"]: Refreshing state... [id=subnet-0d4deddfbb5a91fb4]
aws_lb_target_group.this: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:428654095624:targetgroup/LB-TG/e67209becbaa23df]
aws_security_group.lb: Refreshing state... [id=sg-064f48d9bfed399bb]
aws_subnet.this["pvt_a"]: Refreshing state... [id=subnet-004a42fb567a2c9db]
aws_route_table.public: Refreshing state... [id=rtb-048fac182ed8ff16b]
aws_security_group.autoscaling: Refreshing state... [id=sg-0cd94bbcd7416b122]
aws_lb.this: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:428654095624:loadbalancer/app/terraform-lb/95850150f5e3a1e1]
aws_security_group.web: Refreshing state... [id=sg-07fc4a5ed2155b2bb]
aws_route_table_association.this["Public A"]: Refreshing state... [id=rtbassoc-0ee4f2d65c5657216]
aws_route_table_association.this["Public B"]: Refreshing state... [id=rtbassoc-017054035c06c1d8c]
aws_route_table_association.this["Private A"]: Refreshing state... [id=rtbassoc-0a189d45a98bde555]
aws_route_table_association.this["Private B"]: Refreshing state... [id=rtbassoc-0bc1ddc01b95d2ce2]
aws_security_group.db: Refreshing state... [id=sg-0a40b35c4c89b3b60]
aws_lb_listener.this: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:428654095624:listener/app/terraform-lb/95850150f5e3a1e1/62206753931db8d7]
data.aws_ami.ubuntu: Read complete after 4s [id=ami-06622ba4ceec2e795]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_autoscaling_group.this will be created
  + resource "aws_autoscaling_group" "this" {
      + arn                              = (known after apply)
      + availability_zones               = (known after apply)
      + default_cooldown                 = (known after apply)
      + desired_capacity                 = (known after apply)
      + force_delete                     = true
      + force_delete_warm_pool           = false
      + health_check_grace_period        = 240
      + health_check_type                = "ELB"
      + id                               = (known after apply)
      + ignore_failed_scaling_activities = false
      + load_balancers                   = (known after apply)
      + max_size                         = 5
      + metrics_granularity              = "1Minute"
      + min_size                         = 2
      + name                             = "terraform-autoscaling"
      + name_prefix                      = (known after apply)
      + predicted_capacity               = (known after apply)
      + protect_from_scale_in            = false
      + service_linked_role_arn          = (known after apply)
      + target_group_arns                = [
          + "arn:aws:elasticloadbalancing:us-east-1:428654095624:targetgroup/LB-TG/e67209becbaa23df",
        ]
      + vpc_zone_identifier              = [
          + "subnet-014b64dbe1018cde5",
          + "subnet-0d4deddfbb5a91fb4",
        ]
      + wait_for_capacity_timeout        = "10m"
      + warm_pool_size                   = (known after apply)

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }
    }

  # aws_autoscaling_policy.scaledown will be created
  + resource "aws_autoscaling_policy" "scaledown" {
      + adjustment_type         = "ChangeInCapacity"
      + arn                     = (known after apply)
      + autoscaling_group_name  = "terraform-autoscaling"
      + cooldown                = 180
      + enabled                 = true
      + id                      = (known after apply)
      + metric_aggregation_type = (known after apply)
      + name                    = "Scale Down"
      + policy_type             = "SimpleScaling"
      + scaling_adjustment      = -1
    }

  # aws_autoscaling_policy.scaleup will be created
  + resource "aws_autoscaling_policy" "scaleup" {
      + adjustment_type         = "ChangeInCapacity"
      + arn                     = (known after apply)
      + autoscaling_group_name  = "terraform-autoscaling"
      + cooldown                = 180
      + enabled                 = true
      + id                      = (known after apply)
      + metric_aggregation_type = (known after apply)
      + name                    = "Scale Up"
      + policy_type             = "SimpleScaling"
      + scaling_adjustment      = 1
    }

  # aws_launch_template.this will be created
  + resource "aws_launch_template" "this" {
      + arn             = (known after apply)
      + default_version = (known after apply)
      + id              = (known after apply)
      + image_id        = "ami-06622ba4ceec2e795"
      + instance_type   = "t3.micro"
      + key_name        = "access_key"
      + latest_version  = (known after apply)
      + name            = (known after apply)
      + name_prefix     = "terraform-"
      + tags_all        = (known after apply)
      + user_data       = "IyEvYmluL2Jhc2gKc3VkbyBhcHQtZ2V0IHVwZGF0ZQpzdWRvIGFwdC1nZXQgaW5zdGFsbCAteSBhcGFjaGUyCmVjaG8gJ0hlbGxvIGZyb20gVGVycmFmb3JtJyA+IC92YXIvd3d3L2h0bWwvaW5kZXguaHRtbApzZXJ2aWNlIGh0dHBkIHN0YXJ0IAoKIyBJbnN0YWxhw6fDo28gZG9ja2VyCgpzdWRvIGN1cmwgLWZzU0wgaHR0cHM6Ly9nZXQuZG9ja2VyLmNvbSAtbyBpbnN0YWxsLWRvY2tlci5zaApjYXQgaW5zdGFsbC1kb2NrZXIuc2gKc3VkbyBzaCBpbnN0YWxsLWRvY2tlci5zaCAtLWRyeS1ydW4K"

      + monitoring {
          + enabled = true
        }

      + network_interfaces {
          + associate_public_ip_address = "true"
          + delete_on_termination       = "true"
          + security_groups             = [
              + "sg-0cd94bbcd7416b122",
            ]
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @vanessafso, Action: `pull_request`*